[
  {
    "title": "SDE Intern",
    "company": "HyperBoost AI Solutions PVT. LTD.",
    "description": [
      "Engineered a comprehensive platform tailored for legal professionals, optimizing their entire workflow from in-depth research to seamless document drafting enhancing efficiency and productivity across legal tasks.",
      "Streamlined legal document handling processes, reducing translation time by 50 and improving overall productivity.",
      "Created a document translator that converts case files from regional languages to English, improving accessibility and efficiency for lawyers by 3x."
    ]
  },
  {
    "title": "Full Stack Developer Intern",
    "company": "Bot2Do Technologies",
    "description": [
      "Developed automation software for a manufacturing company, increasing production efficiency by 3x and improving quality assurance accuracy by 2x.",
      "Integrated ZAP and K6 services into the company’s automated testing platform, improving security vulnerability detection by 40% and performance testing efficiency by 30%.",
      "Optimized the AI recommendation engine, resulting in a 1.5x increase in user engagement and a 1.25x rise in sales."
    ]
  },
  {
    "title": "Software Developer Intern",
    "company": "Territorial Army Project",
    "description": [
      "Developed an Infantry Management System, digitalizing processes from leave letters to mails sent to higher ranks, resulting in a 3x increase in administrative efficiency.",
      "Streamlined the letter approval and management process, leading to a 2x improvement in processing speed and reducing errors by 1.5x.",
      "Facilitated multi-level approval workflows, improving communication and reducing processing times by 50%."
    ]
  },
  {
    "title": "MERN Stack Developer Intern",
    "company": "Softwave Solutions",
    "description": [
      "Directed the development of dynamic websites using the MERN stack, improving overall application efficiency significantly.",
      "Led development of key features using React and Node.js/Express.js, boosting user interaction. Optimized MongoDB databases to improve app speed and usability."
    ]
  }
]
